In [1]:
# Pandas Nedir ?
# --------------
# Pandas; Açık Kaynaklı Bir Veri İşleme, Manipüle Etme, Temizleme Vb. İşlemleri Yapabildiğimiz Bir Kütüphanedir.
# NumPy Kütüphanesi Üzerine Kurulmuş Bir Kütühanedir.
# Pandas, Elimizdeki Veriyi Şekillendirip İşlememize Ve Veriden "Anlamlı Sonuçlar" Çıkarmamıza Olanak Sağlar.
# Pandas Kütüphanesinin Temel Elemanları "Series" Ve "DataFrame"lerdir.
# Series Ve DataFrame Nesneleri, Excel Tabloları Gibi Düşünülebilir.

In [2]:
# Pandas Import Etme
# ------------------

import numpy as np
import pandas as pd

In [3]:
my_data = ["Nihal", "Ender", "Yaren", "Ecem", "Armağan"]
my_data

['Nihal', 'Ender', 'Yaren', 'Ecem', 'Armağan']

In [4]:
#pd.series() Fonksiyonu İle Elimizdeki Verileri Series Haline Getirebiliriz.
pd.Series(my_data)

0      Nihal
1      Ender
2      Yaren
3       Ecem
4    Armağan
dtype: object

In [5]:
#Oluşturduğumuz Serilerin Index Yerlerinde Ve Değer Yerlerinde İstediğimiz Şeyleri Yazdırabiliriz.
my_data2 = [1923, 1776, 1876]
my_indexes = ["Türkiye", "USA", "Canada"]
pd.Series(my_data2, my_indexes)

Türkiye    1923
USA        1776
Canada     1876
dtype: int64

In [6]:
#Şu Şekilde De Gösterebiliriz.
pd.Series(data = my_data2, index = my_indexes)

Türkiye    1923
USA        1776
Canada     1876
dtype: int64

In [7]:
#pd.Series() Fonksiyonu, İçerisine Dictionary De Alabilir. Burada Key'ler Index, Value'lar İse Değer Yerine Geçer.
my_dict = {"Nihal" : 56, "Ender" : 57, "Ecem" : 20, "Armağan": 21}
pd.Series(data = my_dict)

Nihal      56
Ender      57
Ecem       20
Armağan    21
dtype: int64

In [8]:
# Serilerde İşlemler

In [9]:
q1 = {"Japan" : 80, "China" : 450, "Turkey" : 150, "India" : 200}
q2 = {"Japan" : 90, "China" : 420, "Turkey" : 230, "India" : 195}

In [10]:
sales_q1 = pd.Series(q1)

In [11]:
sales_q2 = pd.Series(q2)

In [12]:
sales_total = sales_q1 + sales_q2 # Index Sayısı Aynı Olan İki Seri Toplanabilir Ve Çıkarılabilir.
sales_difference = sales_q2 - sales_q1

In [13]:
print(sales_total)
print(sales_difference)

Japan     170
China     870
Turkey    380
India     395
dtype: int64
Japan     10
China    -30
Turkey    80
India     -5
dtype: int64

In [14]:
sales_total.index #.index Metodu İle Indekslere Bakabiliyoruz!

Index(['Japan', 'China', 'Turkey', 'India'], dtype='object')

In [15]:
sales_total.keys() #.keys() , .index İle Aynı Mantıkta.

Index(['Japan', 'China', 'Turkey', 'India'], dtype='object')

In [16]:
sales_total.values #.values Metodu İle Değerlerimize Bakabiliyoruz.

array([170, 870, 380, 395], dtype=int64)

In [17]:
print(sales_total * 2 ) # Serilerin Değerleri Çarpılabilir Ve Bölünebilir.
print(sales_total / 10)

Japan      340
China     1740
Turkey     760
India      790
dtype: int64
Japan     17.0
China     87.0
Turkey    38.0
India     39.5
dtype: float64

In [18]:
q3 = {"Japan" : 80, "China" : 450, "India" : 150, "USA" : 200}
q4 = {"Brazil" : 90, "China" : 420, "India" : 230, "USA" : 195}

In [19]:
sales_q3 = pd.Series(q3)
sales_q4 = pd.Series(q4)

print(sales_q3)
print(sales_q4)

Japan     80
China    450
India    150
USA      200
dtype: int64
Brazil     90
China     420
India     230
USA       195
dtype: int64

In [20]:
sales_total2 = sales_q3 + sales_q4 # Burada Çıktıda 2 Tane NaN Değeri Var , Bunun Sebebi Brazil Ve Japan Indekslerinin 
print(sales_total2)                # Her 2 Seride Olmaması. Diğerinde Olmadığı Ve Bilinemediği İçin NaN Değerler Döndü.
                                   # Nan Değerlerini Farklı Değerlerle Değiştirebiliyoruz Veya Değer Yoksa Kendilerini De 
                                   # Yazdırabiliyoruz. N'asıl Yapıldığını Görelim.

Brazil      NaN
China     870.0
India     380.0
Japan       NaN
USA       395.0
dtype: float64

In [21]:
sales_q3.add(sales_q4, fill_value = 0)

Brazil     90.0
China     870.0
India     380.0
Japan      80.0
USA       395.0
dtype: float64

In [22]:
sales_q3.dtype # Serinin Değerlerinin Tiplerini .dtype İle Görebiliyoruz.

dtype('int64')

In [23]:
# Dataframe Oluşturma:
# --------------------
# Dataframe'in İçinden Bir Ya Da Birden Fazla Column'u Seçme.
# Dataframe'in İçinden Bir Ya Da Birden Fazla Row'u Seçme.
# Dataframe'in İçine Bir Column Ya Da Row Ekleme.
# pd.DataFrame() Fonksiyonu İle Bir Dataframe Oluşturabiliriz.
# Bir Dataframe'de Column İsimleri, Indexler Ve Değerler Bulunur.
# Column İsimleri Ve Indexler, Önceden Tanımlanmak Zorunda Değiller , Oralara Default Değerler (0, 1, 2...) Atanır.
# Ancak Veriler (Değerler) Tanımlamak Zorundayız.

In [24]:
my_data3 = np.random.randint(0, 101, size = (5,4)) # Bu Şekilde, 2 Boyutlu, 5x4'lük Bir Array Oluşturduk.
my_data3

array([[98,  9, 66, 58],
       [87, 59, 47, 21],
       [45,  7,  1,  0],
       [60, 98,  2, 74],
       [77, 80, 85, 38]])

In [25]:
pd.DataFrame(my_data3) # Bu Şekilde De Dataframe Oluşturmuş Oluyoruz.
                       # Soldaki 0, 1, 2, ... ; Row İsimleri İken Üsttekiler , Column İsimleri Olur.
                       # Biz Dataframe'i Oluştururken Bunları Tanımlamadığımız İçin Default Değerler Atandı.

    0   1   2   3
0  98   9  66  58
1  87  59  47  21
2  45   7   1   0
3  60  98   2  74
4  77  80  85  38

In [26]:
# Şimdi De Daha Anlamlı Bir Dataframe Oluşturalım.
# 4 Ülkenin 3 Ay Boyunca Aylık Satışlarını Gösteren Bir Dataframe Yapalım.

my_indexes2 = ["TR", "BR", "USA", "RU"]
my_columns = ["JAN", "FEB", "MAR"]
my_data4 = np.random.randint(0, 101, (4,3))

In [27]:
# Şimdi De Bunlarla Dataframe Oluşturalım.
df1 = pd.DataFrame(data = my_data4, index = my_indexes2, columns = my_columns)
df1

     JAN  FEB  MAR
TR   100   47   81
BR    68   59   63
USA   65  100   88
RU    52   27   61

In [28]:
df1.info() #.info() Metoduyla Dataframe'in İçindeki Tüm Column'ların Temel Bilgilerini Görebiliriz.
           # Örneğin JAN Column'unda 4 Tane Non-null (0 Olmayan) Değer Olduğunu Görüyoruz.

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, TR to RU
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   JAN     4 non-null      int32
 1   FEB     4 non-null      int32
 2   MAR     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

In [29]:
df1.index #.index Metoduyla, Dataframe'in Indexlerini Görebiliyoruz.

Index(['TR', 'BR', 'USA', 'RU'], dtype='object')

In [30]:
df1.index = ["GER", "CAN", "JP", "IND"] #Dataframe'in Indexleri Değiştirilebilir.
df1.index

Index(['GER', 'CAN', 'JP', 'IND'], dtype='object')

In [31]:
df1.columns #.columns Metoduyla, Dataframe'in Columnlarını Görebiliyoruz.

Index(['JAN', 'FEB', 'MAR'], dtype='object')

In [32]:
df1.columns = ["JUN", "JULY", "AUG"] #Dataframe'in Columnları Değiştirilebilir.
df1.columns

Index(['JUN', 'JULY', 'AUG'], dtype='object')

In [33]:
df1

     JUN  JULY  AUG
GER  100    47   81
CAN   68    59   63
JP    65   100   88
IND   52    27   61

### HAZIR BİR DATA ÇAĞIRMAK

In [35]:
# Bir .csv Dosyası İndirmiştik, Onu Dataframe Olarak Okumayı Görelim:
# .csv Dosya Formatını Okumak İçin. pd.read_csv() Metodunu Kullanıyoruz.
# Bu Metodu Denediğimde Hata Aldığım İçin Dosya Yolunun Başına r(read) Koydum.
# Dosyayla Aynı Dizindeysek, Metodun İçine Sadece Dosyanın Adını Vermemiz Yeterli.
# Dosyayla Aynı Dizinde Değilsek, Metodun İçine O Dosyanın Path'ini Vermemiz Gerek.

In [37]:
pd.read_csv(r"C:\Users\HP\Downloads\tips.csv")

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672